app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('', '9fa22eadb3e7fec2956a7f86777e2186aa5f6abf', '2010-02-06 09:25:42', '70e12d5dc302e3d7d2008bbaeabbdcd0ed8d57db', NULL, NULL, 'david', 'test@example.com', '2010-02-06 09:25:42')